[
  {
    "image": "https://cdn.simpleicons.org/facebook",
    "title": "Facebook",
    "companyName": "Meta Platforms, Inc.",
    "id": 101,
    "description": "Facebook, developed by Meta Platforms, Inc., is one of the largest and most influential social networking platforms in the world. It enables billions of users globally to connect, communicate, and share life experiences through a variety of media formats. The platform provides a comprehensive suite of features, including status updates, photo and video sharing, live video broadcasting, and virtual events. Users can create personal profiles, connect with friends and family, and engage in community groups that cater to their interests. Facebook Messenger facilitates instant messaging, voice and video calls, and group conversations, making communication seamless and interactive. Additionally, Facebook Marketplace allows users to buy and sell products locally, enhancing peer-to-peer commerce. Its advanced algorithms provide a highly personalized news feed experience, showcasing content and updates that align with user preferences, interaction history, and trending topics. Businesses and creators benefit from Facebook's advertising solutions, analytics tools, and content promotion capabilities, allowing them to reach global audiences effectively. The platform has also expanded into augmented reality (AR) and virtual reality (VR) integrations, enhancing interactive and immersive experiences. Facebook prioritizes user security and privacy with settings to control visibility, block or report unwanted interactions, and manage personal data. Its continuous innovation in social networking, community building, and digital communication has made it a cultural phenomenon, transforming the way people connect, share, and engage with the world around them, influencing both personal interactions and global social trends.",
    "size": 280,
    "reviews": 165000000,
    "ratingAvg": 3.9,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 28000000 },
      { "name": "2 star", "count": 15000000 },
      { "name": "3 star", "count": 22000000 },
      { "name": "4 star", "count": 35000000 },
      { "name": "5 star", "count": 65000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/instagram",
    "title": "Instagram",
    "companyName": "Meta Platforms, Inc.",
    "id": 102,
    "description": "Instagram is a premier photo and video-sharing social networking platform developed by Meta Platforms, Inc. that has revolutionized visual storytelling and digital expression. With over a billion active users worldwide, Instagram provides a dynamic space for individuals, brands, influencers, and businesses to share moments, creativity, and ideas through stunning visual content. The platform offers multiple content formats including standard posts, Stories that disappear after 24 hours, Reels for short-form video entertainment, IGTV for longer video content, and Live broadcasts for real-time engagement. Users can enhance their photos and videos with sophisticated filters, editing tools, and creative effects that transform ordinary moments into artistic expressions. Instagram's Explore page uses advanced algorithms to curate personalized content recommendations, helping users discover new accounts, trending topics, and interesting posts based on their interests and engagement patterns. The platform's shopping features enable businesses to tag products directly in posts and stories, creating seamless shopping experiences that bridge the gap between discovery and purchase. Instagram Direct messaging facilitates private conversations, allowing users to share posts, create group chats, send disappearing messages, and engage in video calls. The platform has become essential for influencer marketing, brand building, and digital advertising, offering comprehensive analytics tools, sponsored post capabilities, and targeted advertising options. Instagram's emphasis on visual aesthetics has influenced photography trends, marketing strategies, and social media behavior globally. With features like hashtag following, location tagging, collaborative posts, and account verification, Instagram continues to evolve as a multifaceted platform that empowers creative expression, builds communities around shared interests, facilitates business growth, and shapes contemporary visual culture. The platform prioritizes user safety with content moderation, privacy controls, comment filtering, and tools to manage unwanted interactions, making it a trusted space for authentic connection and creative inspiration.",
    "size": 195,
    "reviews": 142000000,
    "ratingAvg": 4.3,
    "downloads": 4200000000,
    "ratings": [
      { "name": "1 star", "count": 12000000 },
      { "name": "2 star", "count": 8000000 },
      { "name": "3 star", "count": 18000000 },
      { "name": "4 star", "count": 38000000 },
      { "name": "5 star", "count": 66000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/whatsapp",
    "title": "WhatsApp",
    "companyName": "Meta Platforms, Inc.",
    "id": 103,
    "description": "WhatsApp Messenger is a globally dominant instant messaging application developed by Meta Platforms, Inc. that has fundamentally transformed personal and business communication across the world. With end-to-end encryption as its cornerstone security feature, WhatsApp ensures that messages, calls, photos, videos, and documents remain private and secure, accessible only to the sender and recipient. The platform supports text messaging, voice messages, voice calls, and video calls with crystal-clear quality, enabling seamless communication regardless of geographical boundaries. WhatsApp's group chat functionality allows up to 256 participants, making it ideal for family conversations, friend circles, work teams, and community organizations. The Status feature enables users to share photos, videos, and text updates that disappear after 24 hours, similar to Stories on other platforms. WhatsApp Web and Desktop applications extend functionality to computers, allowing users to sync conversations across devices for convenient multi-platform access. The platform's document sharing capabilities support various file formats including PDFs, spreadsheets, presentations, and more, facilitating professional collaboration and personal file exchanges. WhatsApp Business provides specialized features for small businesses and enterprises, including business profiles, catalog showcasing, automated messages, quick replies, and labels for organizing conversations. The platform's location sharing feature helps users coordinate meetups and share real-time whereabouts with trusted contacts. Voice messages offer a quick alternative to typing, capturing tone and emotion that text sometimes misses. WhatsApp's broadcast lists allow users to send messages to multiple contacts simultaneously without creating groups. The platform operates on minimal data usage, making it accessible even in areas with limited internet connectivity. With support for over 60 languages, WhatsApp serves diverse global communities, breaking down language barriers and fostering international connections. The platform's simplicity, reliability, and security have made it indispensable for billions of users worldwide, serving as the primary communication tool for personal relationships, family connections, professional networking, customer service, and community engagement across virtually every country and culture.",
    "size": 58,
    "reviews": 118000000,
    "ratingAvg": 4.1,
    "downloads": 5000000000,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 9000000 },
      { "name": "3 star", "count": 16000000 },
      { "name": "4 star", "count": 32000000 },
      { "name": "5 star", "count": 46000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/tiktok",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 104,
    "description": "TikTok is a revolutionary short-form video platform developed by ByteDance that has transformed entertainment, creativity, and social media engagement for millions of users worldwide. The application empowers users to create, edit, and share videos ranging from 15 seconds to 10 minutes, featuring an extensive library of music, sound effects, filters, and special effects that enable limitless creative expression. TikTok's sophisticated algorithm analyzes user preferences, viewing patterns, and engagement behaviors to curate a highly personalized 'For You' feed that continuously serves relevant, entertaining, and engaging content tailored to individual tastes. The platform has become a cultural phenomenon, launching viral trends, dance challenges, comedy sketches, educational content, cooking tutorials, life hacks, and countless other creative formats that spread rapidly across the globe. TikTok's intuitive editing tools include options for adding text overlays, stickers, transitions, green screen effects, speed adjustments, and voice effects, making professional-quality video creation accessible to everyone regardless of technical expertise. The Duet and Stitch features enable collaborative content creation, allowing users to respond to, remix, and build upon other creators' videos, fostering a highly interactive and participatory community. TikTok Live enables real-time broadcasting where creators can interact directly with audiences through live video streams, receiving virtual gifts that can be converted to revenue. The platform's Discover page helps users explore trending hashtags, popular sounds, and viral challenges, keeping them connected to the pulse of internet culture. TikTok has become an essential marketing tool for brands, offering advertising solutions, influencer partnerships, and organic reach opportunities that help businesses connect with younger demographics. The platform supports creators through the TikTok Creator Fund, Brand Partnership programs, and monetization features that reward quality content and audience engagement. TikTok's impact extends beyond entertainment, serving as an educational resource, news source, social activism platform, and career launching pad for countless individuals who have built substantial followings and turned their creativity into professional opportunities. With robust privacy controls, content moderation systems, screen time management tools, and family pairing features, TikTok strives to create a safe, positive, and inclusive environment for users of all ages.",
    "size": 142,
    "reviews": 89000000,
    "ratingAvg": 4.4,
    "downloads": 3500000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 12000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 35000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/snapchat",
    "title": "Snapchat",
    "companyName": "Snap Inc.",
    "id": 105,
    "description": "Snapchat is an innovative multimedia messaging application developed by Snap Inc. that pioneered the concept of ephemeral content and continues to redefine how people communicate visually in the digital age. The platform's core feature centers around sending photos and videos called 'Snaps' that disappear after being viewed, creating authentic, pressure-free communication that encourages spontaneity and genuine self-expression. Snapchat's extensive collection of augmented reality lenses and filters transforms ordinary photos into creative, entertaining, and often hilarious content using facial recognition technology, 3D animations, and interactive effects. The Stories feature allows users to compile Snaps into a narrative that remains visible for 24 hours, enabling friends to follow daily adventures and experiences. Snap Map provides location-sharing capabilities, showing where friends are in real-time and displaying public Stories from specific locations worldwide, creating a global window into events and experiences across different cities and cultures. Snapchat's Chat feature supports text messaging, voice and video calls, and Bitmoji integration, allowing personalized avatars to express emotions and reactions. Spotlight showcases user-generated content similar to TikTok, with an algorithmic feed promoting entertaining videos and offering creators opportunities to earn money based on performance. Discover presents professional content from publishers, brands, and creators, including news, entertainment, sports coverage, and original shows designed specifically for mobile consumption. Snapchat's Memories feature saves Snaps and Stories, allowing users to revisit and reshare favorite moments that would otherwise disappear. The platform's focus on privacy includes features like screenshot notifications, privacy settings for who can contact and view content, and disappearing messages that prioritize user control over personal content. Snapchat has become particularly popular among younger demographics who value authentic, unpolished communication over curated perfection. The platform's innovative camera technology, continuous AR development, and creative tools keep it at the forefront of visual communication innovation. Businesses leverage Snapchat for advertising through Snap Ads, sponsored lenses, and geofilters that enable creative brand engagement with highly engaged audiences. Snapchat's emphasis on camera-first communication, playful interaction, and innovative augmented reality experiences continues to influence how people share moments, stay connected, and experience digital communication in increasingly immersive and creative ways.",
    "size": 178,
    "reviews": 76000000,
    "ratingAvg": 4.0,
    "downloads": 2800000000,
    "ratings": [
      { "name": "1 star", "count": 11000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 14000000 },
      { "name": "4 star", "count": 22000000 },
      { "name": "5 star", "count": 22000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/x",
    "title": "Twitter",
    "companyName": "X Corp.",
    "id": 106,
    "description": "Twitter, now operating under X Corp., is a groundbreaking microblogging and social networking platform that has fundamentally changed how information spreads, conversations happen, and public discourse unfolds in the digital age. The platform enables users to post short messages called tweets, traditionally limited to 280 characters, though extended features now allow longer posts for subscribed users. Twitter serves as a real-time information network where breaking news, trending topics, and viral conversations emerge and spread at unprecedented speed. The platform's retweet functionality allows users to share others' posts with their followers, amplifying messages and enabling content to reach massive audiences rapidly. Hashtags organize conversations around specific topics, events, or movements, making it easy to discover and participate in discussions about subjects of interest. Twitter's reply and thread features facilitate in-depth conversations and debates, allowing users to engage directly with individuals, celebrities, brands, journalists, politicians, and thought leaders from around the world. The platform has become essential for journalists, activists, politicians, businesses, and public figures who use it to share announcements, engage with constituencies, conduct customer service, and shape public opinion. Twitter Lists allow users to organize accounts into curated groups, making it easier to follow specific topics or communities. The Explore tab highlights trending topics, personalized recommendations, and curated moments that capture significant events and conversations. Twitter Spaces offers live audio conversations, enabling real-time discussions similar to audio-based social platforms. The platform's direct messaging allows private conversations between users, supporting both one-on-one and group communications. Twitter's influence extends beyond social networking into journalism, activism, marketing, and public relations, serving as a primary source for breaking news and real-time updates during significant events. The platform has played crucial roles in social movements, political campaigns, emergency communications, and cultural conversations that shape society. Twitter's verification system helps users identify authentic accounts of public figures and organizations. Advanced search capabilities enable users to find specific conversations, track keywords, and monitor topics over time. For businesses and creators, Twitter offers advertising solutions, analytics tools, and monetization features including Super Follows and Tip Jar. The platform's open nature encourages diverse voices and perspectives, though it also requires robust content moderation, user safety tools, and mechanisms to address misinformation and harassment. Twitter continues evolving as a vital communication platform that connects people, spreads information, facilitates conversation, and influences how billions of people understand and engage with the world around them.",
    "size": 94,
    "reviews": 68000000,
    "ratingAvg": 3.6,
    "downloads": 2100000000,
    "ratings": [
      { "name": "1 star", "count": 18000000 },
      { "name": "2 star", "count": 9000000 },
      { "name": "3 star", "count": 13000000 },
      { "name": "4 star", "count": 15000000 },
      { "name": "5 star", "count": 13000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/telegram",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 107,
    "description": "Telegram is a cloud-based instant messaging platform that prioritizes speed, security, and user privacy while offering a comprehensive suite of communication features that rival and often exceed competing applications. Developed by Telegram FZ-LLC, the application utilizes advanced encryption protocols and distributed infrastructure to ensure fast, reliable messaging across all devices and network conditions. Telegram's standout feature is its support for massive group chats accommodating up to 200,000 members, making it ideal for large communities, educational groups, fan clubs, and organizational communications. Channels enable one-to-many broadcasting where administrators can share updates, news, and content with unlimited subscribers, creating powerful platforms for content distribution and audience engagement. Secret Chats provide end-to-end encryption, self-destructing messages, and screenshot prevention, offering maximum privacy for sensitive conversations. The platform's cloud architecture ensures messages, media, and files sync seamlessly across smartphones, tablets, computers, and web browsers, allowing users to access conversations from any device without losing data. Telegram supports sending files up to 2GB each, accommodating large documents, videos, and archives that other platforms restrict. The platform's powerful search functionality finds messages, media, and files across all conversations, even in archived chats. Bots extend Telegram's capabilities, enabling automated services, games, productivity tools, news aggregation, and custom integrations that enhance functionality beyond basic messaging. Telegram's customization options include custom themes, chat backgrounds, animated stickers, and adjustable interface elements that let users personalize their experience. Voice chats in groups and channels support live audio conversations with unlimited participants, perfect for community discussions, live events, and collaborative meetings. The platform's media editing tools allow photo and video modifications before sending, including filters, cropping, drawing, and text overlays. Telegram's commitment to free speech and minimal content moderation has made it popular among activists, journalists, and communities seeking platforms with fewer restrictions, though this also raises challenges around misinformation and harmful content. The platform's open API and protocol documentation enable developers to create third-party clients and integrate Telegram into custom applications. Telegram's sticker ecosystem features thousands of creative sticker packs, with tools for users to create custom stickers personalizing their communication style. The platform's focus on speed ensures messages deliver instantly even on slow connections, with adaptive protocols optimizing performance across varying network conditions. Telegram's business features support customer communication, automated responses, and community building for organizations of all sizes. With no advertisements, subscription fees, or venture capital funding, Telegram maintains independence through founder funding and commitment to keeping the platform free and accessible for everyone.",
    "size": 76,
    "reviews": 52000000,
    "ratingAvg": 4.5,
    "downloads": 1800000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 7000000 },
      { "name": "4 star", "count": 16000000 },
      { "name": "5 star", "count": 22000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/spotify",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 108,
    "description": "Spotify is the world's leading music streaming service developed by Spotify AB, revolutionizing how people discover, listen to, and share music across the globe. The platform provides instant access to over 100 million songs, 5 million podcast titles, and countless audiobooks, covering virtually every genre, artist, and musical style imaginable. Spotify's sophisticated recommendation algorithms analyze listening habits, preferences, and patterns to create personalized playlists like Discover Weekly, Release Radar, and Daily Mixes that introduce users to new music perfectly aligned with their tastes. The platform's search functionality enables users to find specific songs, albums, artists, playlists, podcasts, and lyrics instantly. Spotify's social features allow users to share tracks, playlists, and listening activity with friends, see what others are playing, and create collaborative playlists where multiple people contribute songs. The platform supports both free ad-supported streaming and premium subscriptions that remove advertisements, enable offline downloads, provide higher audio quality, and unlock unlimited skips. Spotify's extensive podcast library has made it a dominant player in podcast distribution, hosting exclusive shows, original content, and productions from creators worldwide. The Car View and integration with automotive systems brings Spotify into vehicles for safe, convenient listening during commutes and road trips. Spotify Connect allows seamless streaming across devices including smartphones, tablets, computers, smart speakers, gaming consoles, and TVs, with the ability to transfer playback between devices effortlessly. The platform's curated playlists cover moods, activities, genres, and decades, providing perfect soundtracks for workouts, focus sessions, parties, relaxation, and any other occasion. Spotify for Artists gives musicians detailed analytics about listeners, streaming numbers, demographics, and playlist additions, empowering artists to understand their audience and grow their careers. The platform's lyrics integration displays synchronized lyrics for many songs, allowing users to sing along and understand song meanings. Spotify's family and duo plans offer cost-effective subscriptions for multiple users, while student plans provide discounted access with verification. The platform's audiobook integration expands beyond music and podcasts into literature and spoken-word content. Spotify's behind-the-lyrics feature provides artist commentary, trivia, and background stories that enrich the listening experience. The platform's group session feature enables multiple people to control playback collaboratively, perfect for parties and shared listening experiences. Spotify's commitment to audio quality includes options for different streaming qualities, with high-fidelity audio options for audiophiles. The platform continues expanding into new audio formats, interactive experiences, and creator tools that empower musicians, podcasters, and audio creators to reach global audiences and build sustainable careers in the digital age.",
    "size": 98,
    "reviews": 64000000,
    "ratingAvg": 4.4,
    "downloads": 2500000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 20000000 },
      { "name": "5 star", "count": 25000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/netflix",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 109,
    "description": "Netflix is the pioneering subscription-based streaming entertainment service developed by Netflix, Inc. that revolutionized how people consume television shows, movies, documentaries, and original content worldwide. The platform provides unlimited, on-demand access to an extensive library containing thousands of titles across every genre imaginable, from blockbuster action films and romantic comedies to gripping dramas, thought-provoking documentaries, animated series, and international cinema. Netflix's groundbreaking original programming includes critically acclaimed series, award-winning films, comedy specials, reality shows, and documentaries that have redefined television excellence and earned numerous Emmy, Oscar, and Golden Globe awards. The platform's sophisticated recommendation algorithm analyzes viewing history, ratings, and preferences to suggest content perfectly matched to individual tastes, helping users discover new favorites from Netflix's vast catalog. Netflix supports simultaneous streaming on multiple devices depending on subscription tier, allowing family members to watch different content simultaneously on smartphones, tablets, computers, smart TVs, and gaming consoles. The download feature enables offline viewing, perfect for travel, commutes, or areas with limited internet connectivity. Netflix's profiles allow each family member to maintain personalized recommendations, watchlists, and viewing histories, ensuring appropriate content suggestions for different ages and preferences. Parental controls provide peace of mind by restricting content based on maturity ratings and creating kid-friendly profiles with curated content suitable for children. Netflix's interactive content, pioneered by titles like Black Mirror: Bandersnatch, allows viewers to make choices that affect story outcomes, creating engaging, personalized narratives. The platform's skip intro feature saves time by jumping past opening credits, while skip recap helps viewers who binge-watch series avoid repetitive recaps. Netflix's commitment to accessibility includes subtitles, closed captions, and audio descriptions in multiple languages, making content accessible to diverse audiences worldwide. The platform's investment in international content brings stories, perspectives, and productions from countries across the globe, breaking down geographical barriers in entertainment consumption. Netflix's release strategy of dropping entire seasons simultaneously revolutionized television viewing, enabling binge-watching culture and water-cooler conversations about shared viewing experiences. The platform's mobile app includes features like Smart Downloads that automatically manage offline content, deleting watched episodes and downloading new ones. Netflix's picture-in-picture mode allows multitasking while watching content on supported devices. The platform's video quality automatically adapts to internet connection speeds, ensuring smooth playback without buffering interruptions. Netflix's premium tier offers 4K Ultra HD and HDR content for superior visual quality on compatible displays. The platform continues investing billions in content production, technology development, and global expansion, maintaining its position as the dominant force in streaming entertainment that has fundamentally transformed the entertainment industry and viewing habits worldwide.",
    "size": 125,
    "reviews": 58000000,
    "ratingAvg": 4.2,
    "downloads": 2300000000,
    "ratings": [
      { "name": "1 star", "count": 7000000 },
      { "name": "2 star", "count": 6000000 },
      { "name": "3 star", "count": 10000000 },
      { "name": "4 star", "count": 18000000 },
      { "name": "5 star", "count": 17000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/youtube",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 110,
    "description": "YouTube is the world's largest video-sharing platform developed by Google LLC, serving as an unprecedented repository of human knowledge, creativity, entertainment, and communication that has fundamentally transformed media consumption and content creation globally. The platform hosts billions of videos covering every imaginable topic from educational tutorials and music videos to vlogs, gaming content, cooking shows, product reviews, news coverage, and documentary-style productions. YouTube enables anyone with a camera and internet connection to become a content creator, democratizing media production and giving voice to individuals, communities, and perspectives previously excluded from traditional media channels. The platform's recommendation algorithm suggests videos based on viewing history, subscriptions, and trending content, creating personalized viewing experiences that keep users engaged while helping them discover new creators and topics. YouTube's subscription feature allows users to follow favorite channels and receive notifications when new content uploads, building loyal audiences for creators. The comment section fosters community interaction, enabling discussions, feedback, and connections between creators and viewers. YouTube's monetization through the Partner Program allows creators to earn revenue from advertisements, channel memberships, Super Chat donations during live streams, and merchandise shelf integrations, enabling thousands of people to build sustainable careers as full-time content creators. YouTube Premium removes advertisements, enables background playback, and provides access to YouTube Music and exclusive original content. The platform's live streaming capabilities support real-time broadcasting for gaming, events, Q&A sessions, tutorials, and breaking news coverage. YouTube Kids provides a child-safe environment with curated content, parental controls, and age-appropriate videos. YouTube Music offers dedicated music streaming with official songs, albums, live performances, covers, and remixes. YouTube's playlist functionality helps organize content for easy access and sequential viewing. The platform's closed caption system improves accessibility and enables viewing without sound, while auto-generated translations break down language barriers. YouTube's community tab allows creators to share updates, polls, and images with subscribers between video uploads. The platform's Stories feature provides short-form video updates similar to other social platforms. YouTube Shorts competes with TikTok by offering vertical, short-form video content with creative tools and algorithmic distribution. YouTube's impact extends beyond entertainment into education, with countless tutorials, courses, lectures, and instructional content serving as free educational resources for billions of learners worldwide. The platform has launched musical careers, influenced political movements, documented history, preserved cultural traditions, and created new forms of entertainment that didn't exist before. YouTube's infrastructure handles more than 500 hours of video uploaded every minute, demonstrating unprecedented scale in user-generated content hosting. The platform continues evolving with improvements in creator tools, monetization options, content policies, and viewing features that shape how humanity creates, shares, and consumes video content in the twenty-first century.",
    "size": 156,
    "reviews": 145000000,
    "ratingAvg": 4.3,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 15000000 },
      { "name": "2 star", "count": 10000000 },
      { "name": "3 star", "count": 20000000 },
      { "name": "4 star", "count": 40000000 },
      { "name": "5 star", "count": 60000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/gmail",
    "title": "Gmail",
    "companyName": "Google LLC",
    "id": 111,
    "description": "Gmail is Google's flagship email service that has redefined electronic communication with innovative features, generous storage, powerful organization tools, and seamless integration with Google's ecosystem of productivity applications. The platform provides free email accounts with substantial storage capacity, eliminating concerns about mailbox limits that plagued earlier email services. Gmail's sophisticated spam filtering uses machine learning to identify and block unwanted emails, phishing attempts, and malicious content, keeping inboxes clean and secure. The platform's conversation view groups related emails into threads, making it easy to follow discussions and maintain context across multiple messages. Gmail's powerful search functionality finds specific emails instantly using keywords, sender information, date ranges, attachment types, and advanced operators. Labels replace traditional folders with flexible categorization that allows emails to belong to multiple categories simultaneously. The platform's Smart Compose feature predicts text as users type, speeding up email composition with AI-powered suggestions. Smart Reply offers one-click response options for quick acknowledgments and brief replies. Gmail's integration with Google Calendar, Google Meet, Google Drive, and other Google Workspace applications creates a unified productivity environment where scheduling meetings, sharing files, and collaborating happens seamlessly within email workflows. The platform's confidential mode allows sending sensitive emails with expiration dates, revocable access, and passcode requirements for enhanced security. Gmail supports custom email signatures, vacation responders, and automatic forwarding. The platform's offline mode enables reading, composing, and organizing emails without internet connectivity, synchronizing changes when reconnection occurs. Gmail's priority inbox automatically identifies important messages based on user behavior and interaction patterns. The snooze feature temporarily removes emails from the inbox, bringing them back at specified times for action. Gmail's unsubscribe functionality simplifies leaving mailing lists with one-click options. The platform supports IMAP and POP protocols, enabling access through third-party email clients. Gmail's mobile applications provide full-featured email access optimized for smartphones and tablets with push notifications for new messages. The platform's security features include two-factor authentication, suspicious activity alerts, and advanced phishing protection. Gmail for business through Google Workspace offers custom domain email addresses, enhanced storage, advanced security controls, and administrative management tools. The platform's keyboard shortcuts enable power users to navigate and process emails rapidly without mouse interaction. Gmail's add-ons extend functionality with integrations for CRM systems, project management tools, and productivity applications. The platform's chat integration brings Google Chat conversations alongside email for unified communication. Gmail's importance of accessibility includes screen reader support, keyboard navigation, high contrast themes, and customizable display densities. The platform's continuous innovation in AI-powered features, security enhancements, and user experience improvements maintains its position as the world's most popular email service, trusted by billions of individuals and organizations for personal and professional communication.",
    "size": 45,
    "reviews": 95000000,
    "ratingAvg": 4.3,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 15000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/googlemaps",
    "title": "Google Maps",
    "companyName": "Google LLC",
    "id": 112,
    "description": "Google Maps is the world's most comprehensive mapping and navigation platform developed by Google LLC, providing detailed geographic information, real-time navigation, local business discovery, and location-based services that have transformed how people navigate, explore, and understand the physical world. The platform combines satellite imagery, street-level photography, real-time traffic data, and user-generated content to create an unparalleled mapping resource covering virtually every corner of the globe. Google Maps' turn-by-turn navigation provides voice-guided directions for driving, walking, cycling, and public transportation, with real-time traffic updates that suggest faster alternative routes to avoid congestion and delays. The platform's Street View feature offers immersive, panoramic street-level imagery that allows users to virtually explore cities, neighborhoods, landmarks, and natural wonders before visiting in person. Google Maps' business listings provide essential information including hours of operation, contact details, customer reviews, photos, popular times, and direct links to websites and reservation systems. The platform's Explore feature helps users discover nearby restaurants, attractions, shops, and services based on location, preferences, and trending popularity. Google Maps' offline functionality allows downloading map areas for navigation without internet connectivity, essential for international travel and remote locations. The platform's timeline feature creates a private history of places visited, routes traveled, and photos taken at specific locations, serving as a personal travel diary. Google Maps supports saving favorite places, creating custom lists collections, and sharing location recommendations with friends and family. The integration with other Google services enables searching Maps from Google Search, accessing Maps within Gmail for event locations, and coordinating travel plans across devices. The platform's Live View uses augmented reality to overlay directional arrows on real-world camera views, making pedestrian navigation intuitive and foolproof. Google Maps' transit directions provide comprehensive public transportation information including schedules, fare information, route options, and real-time vehicle tracking in supported cities. The platform's location sharing allows trusted contacts to see real-time location for safety and coordination purposes. Google Maps for businesses through Google My Business enables companies to manage their online presence, respond to reviews, post updates, and connect with customers. The platform's contributions system allows users to submit reviews, upload photos, answer questions, edit information, and earn recognition for helping improve map data quality. Google Maps' accessibility features include wheelchair-accessible route options, visual and audio guidance, and detailed accessibility information for businesses and transit stations. The platform continues evolving with features like eco-friendly routing that prioritizes fuel-efficient routes, immersive view that combines billions of Street View and aerial images into a rich visual experience, and indoor maps for airports, shopping malls, and public buildings that help navigate complex interior spaces with confidence and ease.",
    "size": 45,
    "reviews": 95000000,
    "ratingAvg": 4.3,
    "downloads": 10000000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 7000000 },
      { "name": "3 star", "count": 15000000 },
      { "name": "4 star", "count": 28000000 },
      { "name": "5 star", "count": 37000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/zoom",
    "title": "Zoom",
    "companyName": "Zoom Video Communications",
    "id": 113,
    "description": "Zoom is a leading video conferencing and virtual meeting platform developed by Zoom Video Communications that became essential infrastructure for remote work, online education, telehealth, and virtual social connections, especially during the global shift toward distributed collaboration. The platform enables high-quality video and audio meetings for up to thousands of participants, with intuitive controls that make joining and hosting meetings accessible to users of all technical skill levels. Zoom's screen sharing capabilities allow presenters to share entire screens, specific application windows, or portions of screens with meeting participants, facilitating presentations, demonstrations, collaborative work, and technical support. The platform's virtual backgrounds and video filters enable users to customize their appearance and surroundings, maintaining privacy and professionalism regardless of physical location. Zoom's breakout rooms feature divides large meetings into smaller groups for focused discussions, team activities, and collaborative exercises, with hosts able to move between rooms and broadcast messages to all groups. The platform's recording functionality captures meetings as video files with options for cloud storage or local saving, enabling absent participants to catch up, teams to review discussions, and organizations to maintain meeting archives. Zoom's chat feature supports public messages visible to all participants and private messages between individuals, with file sharing capabilities for distributing documents, images, and resources during meetings. The platform's polling and Q&A features facilitate audience engagement during webinars and large meetings, collecting feedback and enabling structured question answering. Zoom's waiting room functionality gives hosts control over when participants enter meetings, enhancing security and preventing unwanted disruptions. The platform's co-host capabilities distribute meeting management responsibilities among multiple participants. Zoom's whiteboard feature provides a shared canvas for collaborative brainstorming, diagramming, and visual explanation. The platform's end-to-end encryption option provides enhanced security for sensitive conversations. Zoom's integration with calendar applications streamlines meeting scheduling with automatic link generation and reminders. The platform supports phone dial-in options for participants unable to use internet connections or computer audio. Zoom's mobile applications provide full-featured meeting participation from smartphones and tablets, maintaining flexibility and accessibility across devices. The platform's webinar mode supports large-scale virtual events with features like registration, ticketing, and broadcast-style presentations where attendees can watch and interact without appearing on video. Zoom Rooms extends the platform into physical conference spaces with dedicated hardware for seamless in-person and remote hybrid meetings. The platform's accessibility features include closed captioning, keyboard shortcuts, and screen reader support. Zoom's extensive third-party integrations connect with productivity tools, CRM systems, learning management systems, and communication platforms, embedding video conferencing into existing workflows. The platform's reliability, ease of use, and continuous feature development have made it synonymous with video conferencing, fundamentally changing how teams collaborate, students learn, families connect, and organizations conduct business across distances that previously required physical presence.",
    "size": 118,
    "reviews": 42000000,
    "ratingAvg": 4.4,
    "downloads": 1500000000,
    "ratings": [
      { "name": "1 star", "count": 3000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/reddit",
    "title": "Reddit",
    "companyName": "Reddit, Inc.",
    "id": 116,
    "description": "Reddit is a vast social news aggregation, content rating, and discussion platform developed by Reddit, Inc. that bills itself as the front page of the internet, hosting thousands of communities called subreddits where users share, discuss, and vote on content covering virtually every topic, interest, hobby, and question imaginable. The platform's unique structure organizes content into subreddits, each dedicated to specific topics ranging from broad subjects like news, technology, and science to incredibly niche interests like specific video games, local communities, professional trades, and obscure hobbies. Reddit's voting system allows users to upvote quality content and downvote irrelevant or low-quality posts, creating a democratic content curation mechanism where the most valuable, interesting, or entertaining submissions rise to prominence while poor content sinks into obscurity. The platform's comment system enables threaded discussions where users engage in conversations, debates, share expertise, offer advice, tell stories, and build upon each other's ideas in nested reply chains that can extend dozens of levels deep. Reddit's anonymity and pseudonymity foster open, honest discussions where users feel comfortable sharing personal experiences, asking sensitive questions, and engaging in candid conversations they might avoid on identity-linked social platforms. The platform's AMA (Ask Me Anything) format has hosted notable figures including politicians, celebrities, scientists, authors, and everyday people with unique experiences, facilitating direct question-and-answer sessions between public figures and communities. Reddit's search functionality helps users find specific subreddits, posts, comments, and discussions on virtually any topic. The platform's save feature allows users to bookmark interesting posts and comments for later reference. Reddit's awards system enables users to highlight exceptional content with virtual awards that range from simple silver to elaborate platinum and custom awards that provide recipients with Reddit Premium benefits. The platform's moderation system relies on volunteer community moderators who establish rules, remove inappropriate content, ban problematic users, and maintain community standards within their subreddits. Reddit's cross-posting feature allows sharing content between relevant subreddits, increasing visibility and sparking discussions across multiple communities. The platform's multireddit functionality enables users to create custom feeds combining multiple subreddits into unified browsing experiences. Reddit's user profiles display post history, comment activity, earned karma points, and awards received. The platform's chat and messaging features facilitate private conversations between users. Reddit's mobile app provides full-featured access with optimized interfaces for browsing, posting, and commenting from smartphones. The platform's video hosting, image uploads, and text formatting support various content types. Reddit's live discussion threads facilitate real-time conversations during breaking news, sporting events, television show airings, and other time-sensitive happenings. The platform's community wikis preserve important information, FAQs, and resources within subreddits. Reddit's cultural impact extends beyond the platform itself, influencing internet culture, memes, activism, crowdsourced investigations, and public discourse on countless topics. The platform serves as a valuable resource for technical support, hobby guidance, product recommendations, travel advice, career guidance, emotional support, and specialized knowledge sharing across virtually every human endeavor and interest area imaginable.",
    "size": 98,
    "reviews": 32000000,
    "ratingAvg": 3.8,
    "downloads": 950000000,
    "ratings": [
      { "name": "1 star", "count": 6000000 },
      { "name": "2 star", "count": 4000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 6000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/discord",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 117,
    "description": "Discord is a feature-rich communication platform originally designed for gaming communities but has evolved into a versatile tool for communities of all types, from study groups and creative collaborations to professional teams and social circles. Developed by Discord Inc., the platform combines voice chat, video conferencing, text messaging, and screen sharing in an integrated environment that facilitates real-time communication and community building. Discord's server structure allows users to create dedicated spaces with multiple channels for different topics, purposes, or conversation types, enabling organized communication within communities of any size. Voice channels enable high-quality audio communication for gaming sessions, casual hangouts, study groups, work meetings, or any scenario requiring verbal interaction without the formality of scheduled video calls. The platform's text channels support rich media sharing including images, videos, GIFs, embedded links, and file uploads, with formatting options for organizing messages and highlighting important information. Discord's roles and permissions system provides granular control over member capabilities, allowing server administrators to designate moderators, assign special privileges, create hierarchical structures, and protect sensitive channels from unauthorized access. The platform's direct messaging enables private conversations between users across servers, with support for individual and group DMs. Discord's video chat and screen sharing capabilities support collaborative work, streaming gameplay, sharing presentations, watching content together, or simply seeing friends' faces during conversations. The platform's Go Live feature allows broadcasting gameplay or screen content to small groups without requiring third-party streaming software. Discord's integration ecosystem connects with gaming platforms, music bots, moderation tools, productivity applications, and countless other services through bots and webhooks that extend functionality. The platform's Nitro subscription provides enhanced features including larger file uploads, custom emojis across servers, animated profile pictures, higher video quality, and server boosting capabilities that unlock perks for entire communities. Discord's notification system offers customizable alerts with options for all messages, mentions only, or complete silence on per-channel and per-server bases. The platform's search functionality finds specific messages, media, and conversations across entire server histories. Discord's mobile apps provide full-featured access ensuring users stay connected regardless of device. The platform's low latency audio ensures smooth communication essential for gaming coordination and time-sensitive conversations. Discord's screen reader support, keyboard navigation, and accessibility options ensure inclusive communication. The platform's community guidelines, moderation tools, and safety features help maintain positive environments while giving communities autonomy in establishing their own rules and cultures. Discord's cross-platform compatibility spans Windows, macOS, Linux, iOS, Android, and web browsers, ensuring universal access. The platform's free tier provides robust functionality sufficient for most communities, democratizing high-quality group communication previously requiring expensive conference systems or premium software. Discord's explosive growth beyond gaming communities demonstrates its versatility for education, creative projects, professional networking, fan communities, support groups, and virtually any scenario requiring organized, real-time group communication with persistent history, media sharing, and flexible organizational structures that adapt to community needs.",
    "size": 156,
    "reviews": 48000000,
    "ratingAvg": 4.2,
    "downloads": 1400000000,
    "ratings": [
      { "name": "1 star", "count": 5000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 8000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/twitch",
    "title": "Twitch",
    "companyName": "Amazon.com, Inc.",
    "id": 118,
    "description": "Twitch is the world's leading live streaming platform for gamers, creators, and communities, owned by Amazon.com, Inc., revolutionizing how people watch, interact with, and participate in live content across gaming, creative arts, music, talk shows, and real-life streaming. The platform enables streamers to broadcast live video content to audiences ranging from handful of viewers to hundreds of thousands of concurrent watchers, creating interactive entertainment experiences impossible through traditional media. Twitch's chat system allows real-time interaction between streamers and viewers, with messages, emotes, and reactions creating dynamic conversations that make audiences active participants rather than passive consumers. The platform's emote system has developed its own visual language with custom emoticons that convey reactions, inside jokes, and community sentiments unique to Twitch culture. Twitch's subscription system allows viewers to support favorite streamers through monthly paid subscriptions that provide benefits including ad-free viewing, exclusive emotes, subscriber badges, and access to subscriber-only chat modes. The platform's Bits currency enables viewers to cheer for streamers with animated emotes that provide direct financial support. Twitch's affiliate and partner programs allow creators to monetize content through subscriptions, bits, advertisements, and sponsorships, enabling thousands of people to earn income and build full-time careers as content creators. The platform's raid and host features allow streamers to redirect their audience to other creators' channels when ending streams, fostering community support and discovery. Twitch's clip system enables viewers to capture and share memorable moments from streams, creating viral highlights that extend content reach beyond live broadcasts. The platform's VOD (Video on Demand) functionality archives past broadcasts for viewers who missed live streams, with options for streamers to keep highlights permanently. Twitch's categories organize content by game, creative activity, or theme, helping viewers discover streams aligned with interests. The platform's directory showcases live channels with viewer counts, tags, and previews. Twitch's extension system allows developers to create interactive overlays, polls, mini-games, and tools that enhance stream interactivity. The platform's watch parties enable streamers to watch and react to content with their communities simultaneously. Twitch's squad streaming combines multiple streamers' broadcasts into unified viewing experiences perfect for collaborative content. The platform's mobile app provides full viewing and chatting capabilities on smartphones and tablets. Twitch's Prime Gaming, included with Amazon Prime membership, provides free monthly channel subscriptions, exclusive in-game content, and other benefits. The platform's moderation tools help streamers manage chat behavior, block inappropriate content, and maintain positive community environments with moderator roles, automod filters, and banning capabilities. Twitch's advertising opportunities allow brands to reach engaged audiences through pre-roll ads, mid-roll ads, and sponsorships. The platform's prediction system enables viewers to wager channel points on stream outcomes, increasing engagement during gameplay and events. Twitch's influence extends beyond entertainment into esports broadcasting, charity fundraising, product launches, and live event coverage. The platform's community has developed its own culture, memes, and social norms that influence broader internet culture. Twitch represents a fundamental shift in entertainment consumption toward interactive, participatory experiences where audiences connect with creators and each other in real-time, building genuine communities around shared interests and personalities.",
    "size": 124,
    "reviews": 28000000,
    "ratingAvg": 4.0,
    "downloads": 820000000,
    "ratings": [
      { "name": "1 star", "count": 4000000 },
      { "name": "2 star", "count": 3000000 },
      { "name": "3 star", "count": 6000000 },
      { "name": "4 star", "count": 8000000 },
      { "name": "5 star", "count": 7000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/pinterest",
    "title": "Pinterest",
    "companyName": "Pinterest, Inc.",
    "id": 119,
    "description": "Pinterest is a visual discovery and inspiration platform developed by Pinterest, Inc. that enables users to discover, save, and organize ideas for projects, interests, and aspirations through collections of images and videos called boards. The platform serves as a personalized catalog of inspiration spanning categories including home decor, fashion, recipes, DIY projects, travel destinations, wedding planning, fitness, beauty, art, and countless other lifestyle topics. Pinterest's image-centric interface presents content in a scrollable grid of visually appealing pins that users can save to themed boards for future reference and project planning. The platform's search functionality combines text queries with visual recognition, helping users find specific styles, products, or ideas even when they struggle to articulate exactly what they're seeking. Pinterest's recommendation algorithm analyzes saved pins, searches, and engagement to suggest related content that aligns with individual tastes and interests, creating highly personalized discovery experiences. The platform's board system allows organizing saved pins into themed collections for different projects, interests, or aspirations, with options for public boards visible to all users or secret boards kept private for personal planning. Pinterest's collaborative boards enable multiple users to contribute pins, perfect for group project planning, event coordination, or shared inspiration gathering. The platform's visual search tool allows users to photograph objects or crop portions of pins to find similar items, styles, or ideas, bridging the gap between inspiration and acquisition. Pinterest Lens uses smartphone cameras to identify objects and suggest related pins, helping users find inspiration from the physical world around them. The platform's shopping features connect inspiration directly to purchase opportunities, with buyable pins, product catalogs from retailers, and price tracking for items users are considering. Pinterest's business accounts provide analytics about pin performance, audience demographics, and engagement metrics valuable for brands, creators, and merchants. The platform's advertising solutions enable businesses to promote pins to targeted audiences based on interests, demographics, and search behaviors. Pinterest's Rich Pins pull extra information from websites, providing additional context for articles, recipes, products, and apps directly within pin displays. The platform's following system allows users to follow other users' entire accounts or specific boards that match their interests. Pinterest's save button enables pinning content directly from external websites, allowing users to collect inspiration encountered anywhere online. The platform's trending searches highlight popular queries and seasonal interests, helping users discover timely ideas and participate in trending topics. Pinterest's video pins support moving content for recipes, tutorials, demonstrations, and dynamic storytelling. The platform's community guidelines promote positive, inspiring content while moderating inappropriate material. Pinterest's influence extends beyond the platform itself into retail, hospitality, events, and creative industries where businesses and individuals use it for market research, trend forecasting, and understanding consumer preferences. The platform's emphasis on planning, aspiration, and inspiration creates a uniquely positive social media environment focused on future possibilities rather than past activities, making it a powerful tool for self-improvement, creativity, project execution, and lifestyle development that helps millions of users visualize and realize their goals, dreams, and everyday needs through curated visual discovery.",
    "size": 88,
    "reviews": 24000000,
    "ratingAvg": 4.5,
    "downloads": 750000000,
    "ratings": [
      { "name": "1 star", "count": 2000000 },
      { "name": "2 star", "count": 2000000 },
      { "name": "3 star", "count": 3000000 },
      { "name": "4 star", "count": 7000000 },
      { "name": "5 star", "count": 10000000 }
    ]
  },
  {
    "image": "https://cdn.simpleicons.org/uber",
    "title": "Uber",
    "companyName": "Uber Technologies Inc.",
    "id": 120,
    "description": "Uber is the pioneering ride-sharing and transportation network platform developed by Uber Technologies Inc. that revolutionized urban mobility by connecting riders with drivers through a seamless mobile application that has transformed how millions of people navigate cities worldwide. The platform enables users to request rides with just a few taps, viewing estimated arrival times, fare estimates, and driver information before confirming requests, creating unprecedented convenience and transparency in ground transportation. Uber's real-time tracking shows approaching vehicles on maps, estimated arrival times, driver details including name, photo, vehicle description, and license plate number, enhancing safety and reducing the uncertainty traditional taxi services involved. The platform's cashless payment system automatically charges registered payment methods after rides complete, eliminating awkward payment exchanges and making transactions effortless. Uber's surge pricing dynamically adjusts fares during high-demand periods, incentivizing more drivers to get on the road and ensuring ride availability even during peak times, special events, or challenging weather conditions. The platform offers multiple service tiers including economical Uber Pool for shared rides, standard UberX for everyday transportation, premium UberXL for larger groups, luxurious Uber Black for high-end experiences, and accessibility-focused options. Uber's scheduling feature allows booking rides in advance for important appointments, early flights, or planned events. The platform's split fare functionality enables passengers to divide costs with travel companions directly within the app. Uber's safety features include two-way rating systems where riders and drivers evaluate each other, trip sharing that sends real-time location to trusted contacts, emergency assistance buttons connecting to local authorities, and identity verification requirements for drivers. The platform's driver background checks, vehicle inspections, and insurance requirements establish baseline safety and quality standards. Uber's destination arrival notifications alert riders when drivers arrive at pickup locations. The platform's in-app messaging and calling maintain privacy by not revealing personal phone numbers. Uber Eats extends the platform beyond transportation into food delivery, connecting users with local restaurants and bringing meals to doorsteps with the same tracking and convenience. Uber's driver app enables anyone meeting requirements to earn income by providing rides on flexible schedules, creating economic opportunities for millions worldwide. The platform's upfront pricing shows exact fares before booking for most trips, eliminating surprises and enabling budget planning. Uber's saved places feature streamlines frequent destinations like home and work with one-tap addressing. The platform's ride receipts provide detailed trip records for expense tracking and reimbursement. Uber's global presence across hundreds of cities and countries provides consistent transportation experiences for travelers. The platform's business profiles help companies manage employee transportation with centralized billing and trip oversight. Uber's impact on urban transportation extends beyond convenience to reducing drunk driving incidents, providing flexible income opportunities, and spurring competition that has improved taxi services globally, while also raising important discussions about labor rights, regulatory frameworks, and the future of work in the gig economy era.",
    "size": 156,
    "reviews": 52000000,
    "ratingAvg": 4.1,
    "downloads": 1600000000,
    "ratings": [
      { "name": "1 star", "count": 8000000 },
      { "name": "2 star", "count": 5000000 },
      { "name": "3 star", "count": 9000000 },
      { "name": "4 star", "count": 14000000 },
      { "name": "5 star", "count": 16000000 }
    ]
  }
]